Revit 2024 API
ReloadSwapOutInfo Members
The ReloadSwapOutInfo type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the ReloadSwapOutInfo
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
CurrentVersion
 New version.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Part
 The ElementId of part being swapped.
PreviousVersion
 Previous version.
WasSwapped
 Whether the swap out was successful.
See Also
ReloadSwapOutInfo Class
Autodesk.Revit.DB Namespace